# <center>Pandas Assignment</center>

Import pandas and numpy with their aliases

In [21]:
import pandas as pd
import numpy as np

Create a variable a = pd.Series([ 100, 200, 300, 400])

In [22]:
a = pd.Series([100,200,300,400])

Print a, and data type

In [23]:
print(a,type(a))

0    100
1    200
2    300
3    400
dtype: int64 <class 'pandas.core.series.Series'>

Using indexing access the element 300 from the series a.

In [24]:
print(a[2])

300

What are the values of index for series a?

In [25]:
index=list(a)

Change the index to  ['c', 'a', 'b', 'd']

In [26]:
a.index = ['c','a','b','d']

Access the value in the series with index 'd'

In [27]:
print(a['d'])

400

Sort the values wrt to the index and print it

In [28]:
a=a.sort_index()
print(a)

a    200
b    300
c    100
d    400
dtype: int64

Create a new Pandas Series b having index as 'e', 'f', and 'g' and value 800,450,100 and print it

In [40]:
 b = pd.Series([800,450,100], index=['e','f','g'])

 print(b)

e    800
f    450
g    100
dtype: int64

Append b series at the end of a series

In [41]:
c=pd.concat([a,b])
print(c)

a    200
b    300
c    100
d    400
e    800
f    450
g    100
dtype: int64

In [43]:
#print a again after appending b into it

print(c)

a    200
b    300
c    100
d    400
e    800
f    450
g    100
dtype: int64

Sort the values in descending order of a and print the index of the sorted series

In [44]:
 c = c.sort_values(ascending=False)
print(c)

e    800
f    450
d    400
b    300
a    200
c    100
g    100
dtype: int64

## Pandas DataFrame

### Part 1

Create a pandas dataframe df from the series 'a' that we used in the last section, print the dataframe

In [49]:
 df = pd.DataFrame(c)
 print(df)

     0
e  800
f  450
d  400
b  300
a  200
c  100
g  100

What is the shape of the datafarme <br>
(also, what does it imply?)

In [50]:

df.shape

(7, 1)

Hey! remember shape (7,1) implies dataframe has 7 rows and 1 column.

What is the index of the dataframe, is it same as the series 'a'

In [51]:
# yep its same as the series.
df

     0
e  800
f  450
d  400
b  300
a  200
c  100
g  100

print the head and tail of the dataframe. <br>
Additional - (what does head and tali represent?)

In [52]:
df.head()

     0
e  800
f  450
d  400
b  300
a  200

In [53]:
df.tail()

     0
d  400
b  300
a  200
c  100
g  100

Rename the column of the dataframe as 'points'

In [56]:

df.rename(columns={0:'points'}, inplace=True)
df

   points
e     800
f     450
d     400
b     300
a     200
c     100
g     100

Create another Series 'fruits', which contains random names of fruits from ['orange','mango','apple']. The series should contain 7 elements, randomly selected from ['orange','mango','apple']

In [63]:
#Create fruits array

fruits = pd.Series(['orange','mango','apple'])
fruits = pd.Series(np.random.choice(fruits, size=7))
print(fruits)

0     mango
1     apple
2    orange
3    orange
4     mango
5     mango
6     mango
dtype: object

In [65]:
#Create series fruits out of fruits array

fruits = pd.Series(fruits)
print(fruits)

0     mango
1     apple
2    orange
3    orange
4     mango
5     mango
6     mango
dtype: object

Change the index of fruits to the index of dataframe df

In [67]:

fruits.index = df.index[:len(fruits)]
print(fruits)

e     mango
f     apple
d    orange
b    orange
a     mango
c     mango
g     mango
dtype: object

Add this fruits series as a new column to the dataframe df with its column name as 'fruits'
<br>print the head of the dataframe to verify

In [68]:
df['fruits'] = fruits
print(df.head)

<bound method NDFrame.head of    points  fruits
e     800   mango
f     450   apple
d     400  orange
b     300  orange
a     200   mango
c     100   mango
g     100   mango>

## Pandas Concatenation

Create a dataframe  d1 where the cols are  ‘city’ : [‘Chandigarh’, ‘Delhi’, ‘Kanpur’, ‘Chennai’, ‘Manali’ ] and ‘Temperature’ : [15, 22, 20, 26,-2]

In [71]:
 d1 = pd.DataFrame ({'city' : ['Chandigarh', 'Delhi', 'Kanpur', 'Chennai', 'Manali' ],
                   'Temperature' : [15, 22, 20, 26,-2] })

Print(d1)

In [72]:
print(d1)

         city  Temperature
0  Chandigarh           15
1       Delhi           22
2      Kanpur           20
3     Chennai           26
4      Manali           -2

What is the shape of d1.

In [74]:
d1.shape

(5, 2)

Set city = d1['city']

In [75]:
city=d1['city']

print city <br>
What is the type of city.

In [76]:
print(city, type(city))

0    Chandigarh
1         Delhi
2        Kanpur
3       Chennai
4        Manali
Name: city, dtype: object <class 'pandas.core.series.Series'>

Create another datafeame 'd2' where the columns are <br>
'city' - ['Bengalaru','Coimbatore','Srirangam','Pondicherry'] <br>
'Temperature' - [24,35,36,39]

In [77]:
 d2 = pd.DataFrame({'city':['Bengalaru','Coimbatore','Srirangam','Pondicherry'],
                   'Temperature':[24,35,36,39]})
 print(d2)

          city  Temperature
0    Bengalaru           24
1   Coimbatore           35
2    Srirangam           36
3  Pondicherry           39

print the shape of this dataframe

In [78]:
d2.shape

(4, 2)

merge the two dataframes together, save it in a new dataframe named 'd3'

In [94]:
 d3 = pd.concat([d1,d2])
 print(d3)

          city  Temperature
0   Chandigarh           15
1        Delhi           22
2       Kanpur           20
3      Chennai           26
4       Manali           -2
0    Bengalaru           24
1   Coimbatore           35
2    Srirangam           36
3  Pondicherry           39

In [97]:
d3.reset_index(drop=True, inplace=True)
d3

          city  Temperature
0   Chandigarh           15
1        Delhi           22
2       Kanpur           20
3      Chennai           26
4       Manali           -2
5    Bengalaru           24
6   Coimbatore           35
7    Srirangam           36
8  Pondicherry           39

In [ ]:
Select the part of the dataframe such that it contains cities wherer temp is less then or equal to 20 <br>
How many cities are there?

In [100]:

filtered_cities=d3[d3['Temperature'] <=20] 
number_of_cities = filtered_cities.shape[0] 
print(number_of_cities)

3

Select the part of the dataframe such that it contains the cities where tempearature greater than or equal to 35

In [101]:

hot_cities = d3[d3['Temperature'] >= 35]
print(hot_cities)

          city  Temperature
6   Coimbatore           35
7    Srirangam           36
8  Pondicherry           39

## Applying functions to columns and creating new columns

We need to create another column in d3, which contains  a boolean value for each city to indicate whether it's a union territory or not. 
- HINT: Chandigarh, Pondicherry and Delhi are only 3 union territories here.

In [102]:
# write function here

def is_ut(city):
    union_territories = ['Chandigarh','Pondicherry','Delhi']
    return city in union_territories
    
d3['is_ut'] =d3['city'].apply(is_ut)
print(d3)

          city  Temperature  is_ut
0   Chandigarh           15   True
1        Delhi           22   True
2       Kanpur           20  False
3      Chennai           26  False
4       Manali           -2  False
5    Bengalaru           24  False
6   Coimbatore           35  False
7    Srirangam           36  False
8  Pondicherry           39   True

In [104]:
print (d3)

          city  Temperature  is_ut
0   Chandigarh           15   True
1        Delhi           22   True
2       Kanpur           20  False
3      Chennai           26  False
4       Manali           -2  False
5    Bengalaru           24  False
6   Coimbatore           35  False
7    Srirangam           36  False
8  Pondicherry           39   True

The temperatures mentioned in ‘Temperature’ column are mentioned in Celsius, we need another column which contains the same in Fahrenheit.

HINT - 
- Define a function c_to_f which takes input temp in celsius and returns a value with temperature in Fahrenheit.
- To check: c_to_f(10) should return 50.

In [105]:
# write function here

def c_to_f(temp_celsius):
    return (temp_celsius * 9/5) + 32

In [106]:
# check function c_to_f(10)

def c_to_f(temp_celsius):
    temp_fahrenheit = (temp_celsius* 9/5)
    return temp_fahrenheit
result = c_to_f(10)
print(result)

18.0

In [107]:
# apply function c_to_f to d3 to create a column 'temp_farenhiet'

d3['temp_farenhiet'] = d3['Temperature'].apply(c_to_f)
print(d3)

          city  Temperature  is_ut  temp_farenhiet
0   Chandigarh           15   True            27.0
1        Delhi           22   True            39.6
2       Kanpur           20  False            36.0
3      Chennai           26  False            46.8
4       Manali           -2  False            -3.6
5    Bengalaru           24  False            43.2
6   Coimbatore           35  False            63.0
7    Srirangam           36  False            64.8
8  Pondicherry           39   True            70.2

## Indexing and selecting rows in DataFrame

Select subset of the dataframe d1 such that it contains the cities which are union territories.

In [108]:
d1 = d3[d3['is_ut'] == True]
print(d1)

          city  Temperature  is_ut  temp_farenhiet
0   Chandigarh           15   True            27.0
1        Delhi           22   True            39.6
8  Pondicherry           39   True            70.2

Select a subset of the dataframe d1 such that it contains the cities which only have temperature above 90 Farenhiet.

In [109]:
hot_ut_cities = d1[d1['temp_farenhiet'] > 90]
print(hot_ut_cities)

Empty DataFrame
Columns: [city, Temperature, is_ut, temp_farenhiet]
Index: []

Select only the first three rows of the dataframe d1.

In [110]:
first_three = d1.head(3)
print(first_three)

          city  Temperature  is_ut  temp_farenhiet
0   Chandigarh           15   True            27.0
1        Delhi           22   True            39.6
8  Pondicherry           39   True            70.2

Select all the rows and last two columns in the dataframe.

In [111]:
subset = d1.iloc[:, -2:]
print(subset)

   is_ut  temp_farenhiet
0   True            27.0
1   True            39.6
8   True            70.2

## Groupby

In [136]:
# Create a dataframe using dictionary of your choice

data = {
    'Product': ['A', 'B', 'A', 'B', 'C', 'A'],
    'Sales': [100, 200, 150, 250, 300, 50]}
df = pd.DataFrame(data)
print(data)

{'Product': ['A', 'B', 'A', 'B', 'C', 'A'], 'Sales': [100, 200, 150, 250, 300, 50]}

In [139]:
# Use Groupby of single column with aggregate sum()
total_sales = df.groupby('Product')['Sales'].sum()
print(total_sales)

Product
A    300
B    450
C    300
Name: Sales, dtype: int64

In [140]:
# Use Groupby of single column with aggregate count()
product_counts = df.groupby('Product')['Sales'].count()
print(product_counts)

Product
A    3
B    2
C    1
Name: Sales, dtype: int64

In [141]:
# Use Groupby of single column with aggregate min() and max()
sales_range = df.groupby('Product')['Sales'].agg(['min', 'max'])
print(sales_range)

         min  max
Product
A         50  150
B        200  250
C        300  300

In [143]:
# Use Groupby of any 2 columns with aggregate mean()
mean_sales = df.groupby(['Product'])['Sales'].mean()
print(mean_sales)

Product
A    100.0
B    225.0
C    300.0
Name: Sales, dtype: float64

In [144]:
# Use Groupby of any 2 columns with aggregate min() and max()
sales_stats = df.groupby(['Product'])['Sales'].agg(['min', 'max'])
print(sales_stats)

         min  max
Product
A         50  150
B        200  250
C        300  300

## Data Range

Create a pandas daterange where starting date is 1st of January,2020 and end date is 1st of April 2021, store it in a new variable named 'a'

In [146]:
a = pd.date_range(start='2020-01-01', end='2021-04-01')

print a

In [147]:
print(a)

DatetimeIndex(['2020-01-01', '2020-01-02', '2020-01-03', '2020-01-04',
               '2020-01-05', '2020-01-06', '2020-01-07', '2020-01-08',
               '2020-01-09', '2020-01-10',
               ...
               '2021-03-23', '2021-03-24', '2021-03-25', '2021-03-26',
               '2021-03-27', '2021-03-28', '2021-03-29', '2021-03-30',
               '2021-03-31', '2021-04-01'],
              dtype='datetime64[ns]', length=457, freq='D')

What is the len of a?

In [148]:
print(len(a))

457

What is the type of a?

In [149]:

print(type(a))

<class 'pandas.core.indexes.datetimes.DatetimeIndex'>